app/Controllers/Admin/Laboran.php

SELECT *
FROM `laboran`
---
    public function store()
    {
        $data = $this->laboran->findAll();