app/Controllers/DtlKrs.php

    public function index()
    {
        $model = new Detailkrs();
        $data = $model->findAll();
---
SELECT *
FROM `detailkrs`